data/NASA_2DWMH/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.900000000 0.000000000 -0.010000000)
    (0.670000000 0.000000000 -0.010000000)
    (0.670000000 0.350000000 -0.010000000)
    (-0.900000000 0.350000000 -0.010000000)
    (-0.900000000 0.000000000 0.010000000)
    (0.670000000 0.000000000 0.010000000)
    (0.670000000 0.350000000 0.010000000)
    (-0.900000000 0.350000000 0.010000000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (520 180 1) simpleGrading (3 12 1)
);

edges
(
    spline 0 1
    (
        (-0.900000000 0.000000000 -0.010000000)
        (-0.890187500 0.000000000 -0.010000000)
        (-0.880375000 0.000000000 -0.010000000)
        (-0.870562500 0.000000000 -0.010000000)
        (-0.860750000 0.000000000 -0.010000000)
        (-0.850937500 0.000000000 -0.010000000)
        (-0.841125000 0.000000000 -0.010000000)
        (-0.831312500 0.000000000 -0.010000000)
        (-0.821500000 0.000000000 -0.010000000)
        (-0.811687500 0.000000000 -0.010000000)
        (-0.801875000 0.000000000 -0.010000000)
        (-0.792062500 0.000000000 -0.010000000)
        (-0.782250000 0.000000000 -0.010000000)
        (-0.772437500 0.000000000 -0.010000000)
        (-0.762625000 0.000000000 -0.010000000)
        (-0.752812500 0.000000000 -0.010000000)
        (-0.743000000 0.000000000 -0.010000000)
        (-0.733187500 0.000000000 -0.010000000)
        (-0.723375000 0.000000000 -0.010000000)
        (-0.713562500 0.000000000 -0.010000000)
        (-0.703750000 0.000000000 -0.010000000)
        (-0.693937500 0.000000000 -0.010000000)
        (-0.684125000 0.000000000 -0.010000000)
        (-0.674312500 0.000000000 -0.010000000)
        (-0.664500000 0.000000000 -0.010000000)
        (-0.654687500 0.000000000 -0.010000000)
        (-0.644875000 0.000000000 -0.010000000)
        (-0.635062500 0.000000000 -0.010000000)
        (-0.625250000 0.000000000 -0.010000000)
        (-0.615437500 0.000000000 -0.010000000)
        (-0.605625000 0.000000000 -0.010000000)
        (-0.595812500 0.000000000 -0.010000000)
        (-0.586000000 0.000000000 -0.010000000)
        (-0.576187500 0.000000000 -0.010000000)
        (-0.566375000 0.000000000 -0.010000000)
        (-0.556562500 0.000000000 -0.010000000)
        (-0.546750000 0.000000000 -0.010000000)
        (-0.536937500 0.000000000 -0.010000000)
        (-0.527125000 0.000000000 -0.010000000)
        (-0.517312500 0.000000000 -0.010000000)
        (-0.507500000 0.000000000 -0.010000000)
        (-0.497687500 0.000000000 -0.010000000)
        (-0.487875000 0.000000000 -0.010000000)
        (-0.478062500 0.000000000 -0.010000000)
        (-0.468250000 0.000000000 -0.010000000)
        (-0.458437500 0.000000000 -0.010000000)
        (-0.448625000 0.000000000 -0.010000000)
        (-0.438812500 0.000000000 -0.010000000)
        (-0.429000000 0.000000000 -0.010000000)
        (-0.419187500 0.000000000 -0.010000000)
        (-0.409375000 0.000000000 -0.010000000)
        (-0.399562500 0.000000000 -0.010000000)
        (-0.389750000 0.000000000 -0.010000000)
        (-0.379937500 0.000000000 -0.010000000)
        (-0.370125000 0.000000000 -0.010000000)
        (-0.360312500 0.000000000 -0.010000000)
        (-0.350500000 0.000000000 -0.010000000)
        (-0.340687500 0.000000000 -0.010000000)
        (-0.330875000 0.000000000 -0.010000000)
        (-0.321062500 0.000000000 -0.010000000)
        (-0.311250000 0.000000000 -0.010000000)
        (-0.301437500 0.000000000 -0.010000000)
        (-0.291625000 0.000000000 -0.010000000)
        (-0.281812500 0.000000000 -0.010000000)
        (-0.272000000 0.000000000 -0.010000000)
        (-0.262187500 0.000000000 -0.010000000)
        (-0.252375000 0.000000000 -0.010000000)
        (-0.242562500 0.000000000 -0.010000000)
        (-0.232750000 0.000000000 -0.010000000)
        (-0.222937500 0.000000000 -0.010000000)
        (-0.213125000 0.000000000 -0.010000000)
        (-0.203312500 0.000000000 -0.010000000)
        (-0.193500000 0.000000000 -0.010000000)
        (-0.183687500 0.000000000 -0.010000000)
        (-0.173875000 0.000000000 -0.010000000)
        (-0.164062500 0.000000000 -0.010000000)
        (-0.154250000 0.000000000 -0.010000000)
        (-0.144437500 0.000000000 -0.010000000)
        (-0.134625000 0.000000000 -0.010000000)
        (-0.124812500 0.000000000 -0.010000000)
        (-0.115000000 0.000000000 -0.010000000)
        (-0.105187500 0.000000000 -0.010000000)
        (-0.095375000 0.000000000 -0.010000000)
        (-0.085562500 0.000000000 -0.010000000)
        (-0.075750000 0.000000000 -0.010000000)
        (-0.065937500 0.000000000 -0.010000000)
        (-0.056125000 0.000000000 -0.010000000)
        (-0.046312500 0.000000000 -0.010000000)
        (-0.036500000 0.000000000 -0.010000000)
        (-0.026687500 0.000000000 -0.010000000)
        (-0.016875000 0.000000000 -0.010000000)
        (-0.007062500 0.000000000 -0.010000000)
        (0.002750000 0.000022422 -0.010000000)
        (0.012562500 0.000466606 -0.010000000)
        (0.022375000 0.001470769 -0.010000000)
        (0.032187500 0.003013310 -0.010000000)
        (0.042000000 0.005061050 -0.010000000)
        (0.051812500 0.007569941 -0.010000000)
        (0.061625000 0.010486019 -0.010000000)
        (0.071437500 0.013746557 -0.010000000)
        (0.081250000 0.017281422 -0.010000000)
        (0.091062500 0.021014579 -0.010000000)
        (0.100875000 0.024865727 -0.010000000)
        (0.110687500 0.028752028 -0.010000000)
        (0.120500000 0.032589888 -0.010000000)
        (0.130312500 0.036296754 -0.010000000)
        (0.140125000 0.039792893 -0.010000000)
        (0.149937500 0.043003101 -0.010000000)
        (0.159750000 0.045858327 -0.010000000)
        (0.169562500 0.048297156 -0.010000000)
        (0.179375000 0.050267128 -0.010000000)
        (0.189187500 0.051725868 -0.010000000)
        (0.199000000 0.052642001 -0.010000000)
        (0.208812500 0.052995818 -0.010000000)
        (0.218625000 0.052779711 -0.010000000)
        (0.228437500 0.051998327 -0.010000000)
        (0.238250000 0.050668474 -0.010000000)
        (0.248062500 0.048818757 -0.010000000)
        (0.257875000 0.046488963 -0.010000000)
        (0.267687500 0.043729207 -0.010000000)
        (0.277500000 0.040598850 -0.010000000)
        (0.287312500 0.037165227 -0.010000000)
        (0.297125000 0.033502195 -0.010000000)
        (0.306937500 0.029688546 -0.010000000)
        (0.316750000 0.025806311 -0.010000000)
        (0.326562500 0.021938997 -0.010000000)
        (0.336375000 0.018169791 -0.010000000)
        (0.346187500 0.014579767 -0.010000000)
        (0.356000000 0.011246148 -0.010000000)
        (0.365812500 0.008240639 -0.010000000)
        (0.375625000 0.005627889 -0.010000000)
        (0.385437500 0.003464098 -0.010000000)
        (0.395250000 0.001795809 -0.010000000)
        (0.405062500 0.000658908 -0.010000000)
        (0.414875000 0.000077849 -0.010000000)
        (0.424687500 0.000000000 -0.010000000)
        (0.434500000 0.000000000 -0.010000000)
        (0.444312500 0.000000000 -0.010000000)
        (0.454125000 0.000000000 -0.010000000)
        (0.463937500 0.000000000 -0.010000000)
        (0.473750000 0.000000000 -0.010000000)
        (0.483562500 0.000000000 -0.010000000)
        (0.493375000 0.000000000 -0.010000000)
        (0.503187500 0.000000000 -0.010000000)
        (0.513000000 0.000000000 -0.010000000)
        (0.522812500 0.000000000 -0.010000000)
        (0.532625000 0.000000000 -0.010000000)
        (0.542437500 0.000000000 -0.010000000)
        (0.552250000 0.000000000 -0.010000000)
        (0.562062500 0.000000000 -0.010000000)
        (0.571875000 0.000000000 -0.010000000)
        (0.581687500 0.000000000 -0.010000000)
        (0.591500000 0.000000000 -0.010000000)
        (0.601312500 0.000000000 -0.010000000)
        (0.611125000 0.000000000 -0.010000000)
        (0.620937500 0.000000000 -0.010000000)
        (0.630750000 0.000000000 -0.010000000)
        (0.640562500 0.000000000 -0.010000000)
        (0.650375000 0.000000000 -0.010000000)
        (0.660187500 0.000000000 -0.010000000)
        (0.670000000 0.000000000 -0.010000000)
    )
    spline 4 5
    (
        (-0.900000000 0.000000000 0.010000000)
        (-0.890187500 0.000000000 0.010000000)
        (-0.880375000 0.000000000 0.010000000)
        (-0.870562500 0.000000000 0.010000000)
        (-0.860750000 0.000000000 0.010000000)
        (-0.850937500 0.000000000 0.010000000)
        (-0.841125000 0.000000000 0.010000000)
        (-0.831312500 0.000000000 0.010000000)
        (-0.821500000 0.000000000 0.010000000)
        (-0.811687500 0.000000000 0.010000000)
        (-0.801875000 0.000000000 0.010000000)
        (-0.792062500 0.000000000 0.010000000)
        (-0.782250000 0.000000000 0.010000000)
        (-0.772437500 0.000000000 0.010000000)
        (-0.762625000 0.000000000 0.010000000)
        (-0.752812500 0.000000000 0.010000000)
        (-0.743000000 0.000000000 0.010000000)
        (-0.733187500 0.000000000 0.010000000)
        (-0.723375000 0.000000000 0.010000000)
        (-0.713562500 0.000000000 0.010000000)
        (-0.703750000 0.000000000 0.010000000)
        (-0.693937500 0.000000000 0.010000000)
        (-0.684125000 0.000000000 0.010000000)
        (-0.674312500 0.000000000 0.010000000)
        (-0.664500000 0.000000000 0.010000000)
        (-0.654687500 0.000000000 0.010000000)
        (-0.644875000 0.000000000 0.010000000)
        (-0.635062500 0.000000000 0.010000000)
        (-0.625250000 0.000000000 0.010000000)
        (-0.615437500 0.000000000 0.010000000)
        (-0.605625000 0.000000000 0.010000000)
        (-0.595812500 0.000000000 0.010000000)
        (-0.586000000 0.000000000 0.010000000)
        (-0.576187500 0.000000000 0.010000000)
        (-0.566375000 0.000000000 0.010000000)
        (-0.556562500 0.000000000 0.010000000)
        (-0.546750000 0.000000000 0.010000000)
        (-0.536937500 0.000000000 0.010000000)
        (-0.527125000 0.000000000 0.010000000)
        (-0.517312500 0.000000000 0.010000000)
        (-0.507500000 0.000000000 0.010000000)
        (-0.497687500 0.000000000 0.010000000)
        (-0.487875000 0.000000000 0.010000000)
        (-0.478062500 0.000000000 0.010000000)
        (-0.468250000 0.000000000 0.010000000)
        (-0.458437500 0.000000000 0.010000000)
        (-0.448625000 0.000000000 0.010000000)
        (-0.438812500 0.000000000 0.010000000)
        (-0.429000000 0.000000000 0.010000000)
        (-0.419187500 0.000000000 0.010000000)
        (-0.409375000 0.000000000 0.010000000)
        (-0.399562500 0.000000000 0.010000000)
        (-0.389750000 0.000000000 0.010000000)
        (-0.379937500 0.000000000 0.010000000)
        (-0.370125000 0.000000000 0.010000000)
        (-0.360312500 0.000000000 0.010000000)
        (-0.350500000 0.000000000 0.010000000)
        (-0.340687500 0.000000000 0.010000000)
        (-0.330875000 0.000000000 0.010000000)
        (-0.321062500 0.000000000 0.010000000)
        (-0.311250000 0.000000000 0.010000000)
        (-0.301437500 0.000000000 0.010000000)
        (-0.291625000 0.000000000 0.010000000)
        (-0.281812500 0.000000000 0.010000000)
        (-0.272000000 0.000000000 0.010000000)
        (-0.262187500 0.000000000 0.010000000)
        (-0.252375000 0.000000000 0.010000000)
        (-0.242562500 0.000000000 0.010000000)
        (-0.232750000 0.000000000 0.010000000)
        (-0.222937500 0.000000000 0.010000000)
        (-0.213125000 0.000000000 0.010000000)
        (-0.203312500 0.000000000 0.010000000)
        (-0.193500000 0.000000000 0.010000000)
        (-0.183687500 0.000000000 0.010000000)
        (-0.173875000 0.000000000 0.010000000)
        (-0.164062500 0.000000000 0.010000000)
        (-0.154250000 0.000000000 0.010000000)
        (-0.144437500 0.000000000 0.010000000)
        (-0.134625000 0.000000000 0.010000000)
        (-0.124812500 0.000000000 0.010000000)
        (-0.115000000 0.000000000 0.010000000)
        (-0.105187500 0.000000000 0.010000000)
        (-0.095375000 0.000000000 0.010000000)
        (-0.085562500 0.000000000 0.010000000)
        (-0.075750000 0.000000000 0.010000000)
        (-0.065937500 0.000000000 0.010000000)
        (-0.056125000 0.000000000 0.010000000)
        (-0.046312500 0.000000000 0.010000000)
        (-0.036500000 0.000000000 0.010000000)
        (-0.026687500 0.000000000 0.010000000)
        (-0.016875000 0.000000000 0.010000000)
        (-0.007062500 0.000000000 0.010000000)
        (0.002750000 0.000022422 0.010000000)
        (0.012562500 0.000466606 0.010000000)
        (0.022375000 0.001470769 0.010000000)
        (0.032187500 0.003013310 0.010000000)
        (0.042000000 0.005061050 0.010000000)
        (0.051812500 0.007569941 0.010000000)
        (0.061625000 0.010486019 0.010000000)
        (0.071437500 0.013746557 0.010000000)
        (0.081250000 0.017281422 0.010000000)
        (0.091062500 0.021014579 0.010000000)
        (0.100875000 0.024865727 0.010000000)
        (0.110687500 0.028752028 0.010000000)
        (0.120500000 0.032589888 0.010000000)
        (0.130312500 0.036296754 0.010000000)
        (0.140125000 0.039792893 0.010000000)
        (0.149937500 0.043003101 0.010000000)
        (0.159750000 0.045858327 0.010000000)
        (0.169562500 0.048297156 0.010000000)
        (0.179375000 0.050267128 0.010000000)
        (0.189187500 0.051725868 0.010000000)
        (0.199000000 0.052642001 0.010000000)
        (0.208812500 0.052995818 0.010000000)
        (0.218625000 0.052779711 0.010000000)
        (0.228437500 0.051998327 0.010000000)
        (0.238250000 0.050668474 0.010000000)
        (0.248062500 0.048818757 0.010000000)
        (0.257875000 0.046488963 0.010000000)
        (0.267687500 0.043729207 0.010000000)
        (0.277500000 0.040598850 0.010000000)
        (0.287312500 0.037165227 0.010000000)
        (0.297125000 0.033502195 0.010000000)
        (0.306937500 0.029688546 0.010000000)
        (0.316750000 0.025806311 0.010000000)
        (0.326562500 0.021938997 0.010000000)
        (0.336375000 0.018169791 0.010000000)
        (0.346187500 0.014579767 0.010000000)
        (0.356000000 0.011246148 0.010000000)
        (0.365812500 0.008240639 0.010000000)
        (0.375625000 0.005627889 0.010000000)
        (0.385437500 0.003464098 0.010000000)
        (0.395250000 0.001795809 0.010000000)
        (0.405062500 0.000658908 0.010000000)
        (0.414875000 0.000077849 0.010000000)
        (0.424687500 0.000000000 0.010000000)
        (0.434500000 0.000000000 0.010000000)
        (0.444312500 0.000000000 0.010000000)
        (0.454125000 0.000000000 0.010000000)
        (0.463937500 0.000000000 0.010000000)
        (0.473750000 0.000000000 0.010000000)
        (0.483562500 0.000000000 0.010000000)
        (0.493375000 0.000000000 0.010000000)
        (0.503187500 0.000000000 0.010000000)
        (0.513000000 0.000000000 0.010000000)
        (0.522812500 0.000000000 0.010000000)
        (0.532625000 0.000000000 0.010000000)
        (0.542437500 0.000000000 0.010000000)
        (0.552250000 0.000000000 0.010000000)
        (0.562062500 0.000000000 0.010000000)
        (0.571875000 0.000000000 0.010000000)
        (0.581687500 0.000000000 0.010000000)
        (0.591500000 0.000000000 0.010000000)
        (0.601312500 0.000000000 0.010000000)
        (0.611125000 0.000000000 0.010000000)
        (0.620937500 0.000000000 0.010000000)
        (0.630750000 0.000000000 0.010000000)
        (0.640562500 0.000000000 0.010000000)
        (0.650375000 0.000000000 0.010000000)
        (0.660187500 0.000000000 0.010000000)
        (0.670000000 0.000000000 0.010000000)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
