data/NASA_2DWMH/system/residuals
type            residuals;
libs            ("libutilityFunctionObjects.so");
writeControl    timeStep;
writeInterval   1;

#include "../fieldDef"

fields          $residualFields;
