data/NASA_2DWMH/system/singleGraph_xm214
type            sets;
libs            ("libsampling.so");
writeControl    writeTime;
setFormat       raw;
interpolationScheme cell;

#include "../fieldDef"

fields          $singleGraphFields;

sets
(
    line
    {
        type        uniform;
        axis        xyz;
        nPoints     240;
        start       (-0.89 0 0);
        end         (-0.89 0.35 0);
    }
);
